Repository: mohamedamineidir-dotcom/UltraTrain
Catalog: UltraTrain/Resources/Localizable.xcstrings
Source language: en
Languages: fr

# phase.road.taper
source: Race taper
fr: Affûtage

# phase.road.taper.desc
source: Volume reduction with race-pace sharpeners
fr: Réduction du volume avec rappels d'allure course

# phase.road.thresholdVo2
source: Threshold & VO2max
fr: Seuil & VO2max

# phase.road.thresholdVo2.desc
source: Threshold blocks and VO2max intervals to sharpen the engine
fr: Blocs au seuil et VO2max pour affûter la cylindrée

# phase.taper
source: Race taper
fr: Affûtage

# phase.trail.postRace
source: Post-Race Recovery
fr: Récupération post-course

# phase.trail.postRace.desc
source: Active recovery and adaptation after competition
fr: Récupération active et adaptation après la compétition

# phase.trail.sharpening
source: Sharpening
fr: Affûtage

# phase.trail.sharpening.desc
source: Volume reduction and race-day sharpening
fr: Réduction du volume et affûtage pour le jour J

# phase.trail.threshold30
source: 30' Threshold
fr: Seuil 30'

# phase.trail.threshold30.desc
source: Build aerobic power with 30-minute threshold efforts on hills
fr: Développez la puissance aérobie avec des efforts au seuil de 30 minutes en côte

# phase.trail.threshold60
source: 60' Threshold
fr: Seuil 60'

# phase.trail.threshold60.desc
source: Sustained 60-minute threshold on rolling terrain, race-specific endurance
fr: Seuil soutenu de 60 minutes sur terrain vallonné : endurance spécifique à la course

# phase.trail.vo2max
source: VO2max Hills
fr: Côtes VO2max

# phase.trail.vo2max.desc
source: VO2max intervals on steep climbs, short, intense hill repeats
fr: Intervalles VO2max sur pentes raides : répétitions de côte courtes et intenses

# phaseDesc.race
source: Race week
fr: Semaine de course

# phaseDesc.recovery
source: Active recovery and adaptation
fr: Récupération active et adaptation

# phaseDesc.road.base
source: Build aerobic foundation with easy running and strides
fr: Développez la base aérobie avec footing facile et lignes droites

# phaseDesc.road.build
source: VO2max intervals and tempo runs to build speed
fr: Intervalles VO2max et tempo pour gagner en vitesse

# phaseDesc.road.peak
source: Race-specific workouts at target pace
fr: Séances spécifiques à l'allure de course

# phaseDesc.road.taper
source: Volume reduction with race-pace sharpeners
fr: Réduction du volume avec rappels à l'allure de course

# phaseDesc.trail.base
source: Hill threshold foundation, 30-minute tempo efforts on hills
fr: Base de seuil en côte : efforts tempo de 30 minutes en côte

# phaseDesc.trail.build
source: VO2max intervals on steep climbs, short, intense hill repeats
fr: Intervalles VO2max sur pentes raides : répétitions de côte courtes et intenses

# phaseDesc.trail.peak
source: Sustained threshold on rolling terrain, race-specific endurance
fr: Seuil soutenu sur terrain vallonné : endurance spécifique à la course

# phaseDesc.trail.taper
source: Volume reduction, freshness for race day
fr: Réduction du volume, fraîcheur pour le jour de course

# phaseHeader.raceWeek
source: Race Week
fr: Semaine de course

# phaseHeader.recovery
source: Recovery
fr: Récupération

source: Phone number
fr: Numéro de téléphone

source: Phone Number
fr: Numéro de téléphone

source: Pick a day to rest on
fr: Choisissez un jour de repos

source: Pick a Route
fr: Choisir un itinéraire

source: Pick at least one format above and you'll be able to choose brands for it here.
fr: Sélectionnez au moins un format ci-dessus et vous pourrez choisir les marques associées ici.

source: Pick from Route Library
fr: Choisir dans la bibliothèque d'itinéraires

source: Pick the brands you already trust per format. We'll build your plan around their exact products. Skip anything where you have no preference.
fr: Choisissez les marques en qui vous avez confiance par format. Nous construirons votre plan autour de leurs produits exacts. Passez ce pour quoi vous n'avez pas de préférence.

source: Plan Adherence
fr: Respect du plan

source: Plan adherence score
fr: Score de respect du plan

# Plan adherence: %@. %lld of %lld sessions completed. %@
source: Plan adherence: %1$@. %2$lld of %3$lld sessions completed. %4$@
fr: Adhérence au plan : %1$@. %2$lld sur %3$lld séances terminées. %4$@

source: Plan Comparison
fr: Comparaison de plans

source: Plan keeps current pace anchors
fr: Le plan conserve les allures de référence actuelles

source: Plan may be outdated
fr: Le plan est peut-être obsolète

source: Plan May Be Outdated
fr: Le plan est peut-être obsolète

source: Plan options
fr: Options du plan

source: Plan ramps as designed.
fr: Le plan monte en charge comme prévu.

source: Plan refined from your training
fr: Plan affiné à partir de votre entraînement

source: Plan timeline
fr: Chronologie du plan

source: Planned
fr: Planifié

# Planned %lld g/hr · %lld min · %lld of %lld
source: Planned %1$lld g/hr · %2$lld min · %3$lld of %4$lld
fr: Prévu %lld g/h · %lld min · %lld sur %lld

source: Planned Sessions
fr: Séances planifiées

# planOpts.testTypeBlurb
source: Around week 4-5 we'll schedule a %@ to recalibrate your training paces.
fr: Vers la semaine 4-5, nous programmerons un %@ pour recalibrer vos allures d'entraînement.

source: Play
fr: Lecture

source: Plays sound and vibration for nutrition reminders
fr: Joue un son et une vibration pour les rappels nutritionnels

source: Please close and reopen UltraTrain for the iCloud sync change to take effect.
fr: Veuillez fermer et rouvrir UltraTrain pour que le changement iCloud prenne effet.

source: Portion size
fr: Taille de la portion

source: Portion Size
fr: Taille de la portion

source: Post-Race Analysis
fr: Analyse post-course

source: Post-run analysis
fr: Analyse post-course

source: PR
fr: RP

# pr.add.accessibility
source: Log a new PR
fr: Enregistrer un nouveau record

# pr.block.fitness
source: Current fitness
fr: Forme actuelle

# pr.block.fitness.subtitle
source: Equivalent times from your best recent result
fr: Temps équivalents d'après votre meilleur résultat récent

# pr.block.official
source: Your records
fr: Vos records

# pr.edit.currentBest
source: Best %@
fr: Record %@

# pr.edit.dateAchieved
source: Achieved on
fr: Réalisé le

# pr.edit.newBest
source: New PR
fr: Nouveau record

# pr.edit.time
source: Time
fr: Temps

# pr.edit.timePrompt
source: Set your finish time
fr: Définissez votre temps

# pr.edit.title
source: Log a PR
fr: Enregistrer un record

# pr.empty.body
source: Log a recent race time and we'll project your fitness across every distance, then calibrate your training paces.
fr: Enregistrez un temps de course récent et nous projetterons votre forme à chaque distance, puis calibrerons vos allures d'entraînement.

# pr.empty.cta
source: Log your first PR
fr: Enregistrer votre premier record

# pr.empty.title
source: No fitness data yet
fr: Pas encore de données de forme

# pr.recalibration.alertTitle
source: Plan updated
fr: Plan mis à jour

# pr.recalibration.message
source: Updating your training paces…
fr: Mise à jour de vos allures d'entraînement…

# pr.recalibration.summary
source: %d session(s) updated to match your new fitness.
fr: %d séance(s) mise(s) à jour selon votre nouvelle forme.

# pr.row.estimated
source: Estimated
fr: Estimé

# pr.row.projected
source: Projected
fr: Projeté

# pr.row.unknown
source: Add a PR to estimate
fr: Ajoutez un record pour estimer

# pr.section.footer
source: Your records are the times you've actually run. Current fitness projects equivalents across every distance from your best recent result, and updates as you train or log a faster PR.
fr: Vos records sont les temps que vous avez réellement réalisés. La forme actuelle projette des équivalents sur chaque distance à partir de votre meilleur résultat récent, et évolue à mesure que vous vous entraînez ou enregistrez un record plus rapide.

# pr.section.title
source: Your records
fr: Vos records

# pr.title
source: Personal records
fr: Records personnels

source: Practice your race-day nutrition during this run.
fr: Pratiquez votre nutrition de course pendant cette sortie.

# prc.msg
source: Your B-race %1$@ (%2$@, ~%3$@ effective km) is more demanding than your A-race %4$@ (~%5$@ effective km), and falls only ~%6$lld weeks before. Recovery from an effort that size realistically takes 4-6 weeks, your A-race goal will likely be affected. Consider whether to swap A/B priority, set a more conservative A-race goal, or push the A-race further out.
fr: Votre course B %1$@ (%2$@, ~%3$@ km effectifs) est plus exigeante que votre course A %4$@ (~%5$@ km effectifs), et tombe seulement ~%6$lld semaines avant. La récupération d'un effort de cette taille prend réellement 4-6 semaines ; votre objectif de course A en sera probablement affecté. Envisagez d'inverser la priorité A/B, de fixer un objectif de course A plus prudent, ou de repousser la course A.

# prc.title
source: B-race may compromise A-race goal
fr: La course B pourrait compromettre l'objectif de la course A

source: Pre-race meal timing
fr: Timing du repas d'avant-course

source: Pre-Run Briefing
fr: Briefing pré-course

# prebrief.focus.b2b
source: Second day of back-to-back: practice running on tired legs.
fr: Deuxième jour du Weekend Choc : entraînez-vous à courir sur jambes fatiguées.

# prebrief.focus.crossTraining
source: Active recovery through cross-training. Keep it enjoyable.
fr: Récupération active en cross-training. Gardez le plaisir.

# prebrief.focus.free
source: Free run: enjoy the movement.
fr: Course libre : profitez du mouvement.

# prebrief.focus.intervals
source: Push hard on the work intervals, recover fully between sets.
fr: Poussez fort sur les fractions de travail, récupérez complètement entre les séries.

# prebrief.focus.longRun
source: Focus on consistent effort and practice race-day nutrition.
fr: Concentrez-vous sur un effort régulier et entraînez votre nutrition de course.

# prebrief.focus.race
source: Race day: execute your plan, trust your fitness.
fr: Jour de course : exécutez votre plan, faites confiance à votre forme.

# prebrief.focus.recovery
source: Easy does it. This run is about blood flow, not fitness.
fr: On y va tranquille. Cette sortie, c'est la circulation, pas la performance.

# prebrief.focus.rest
source: Rest day: recovery is when adaptation happens.
fr: Jour de repos : c'est pendant la récupération que se produit l'adaptation.

# prebrief.focus.strength
source: Strength session: focus on form and controlled movement.
fr: Séance de renforcement : concentrez-vous sur la technique et le mouvement contrôlé.

# prebrief.focus.tempo
source: Maintain a comfortably hard effort. You should be able to speak in short phrases.
fr: Maintenez un effort difficile mais soutenable. Vous devriez pouvoir parler par phrases courtes.

# prebrief.focus.vg
source: Hike the steeps, run the flats. Focus on vertical efficiency.
fr: Marchez les raides, courez les plats. Concentrez-vous sur l'efficacité en montée.

# prebrief.nutrition.over2h
source: Run over 2 hours: bring fuel and hydration. Aim for %1$lld-%2$lld cal/hr.
fr: Sortie de plus de 2 heures : emportez ravitaillement et hydratation. Visez %1$lld-%2$lld cal/h.

# prebrief.nutrition.over90
source: Run over 90 min: consider bringing water and a gel.
fr: Sortie de plus de 90 min : pensez à emporter de l'eau et un gel.

# prebrief.pacing.fatigued
source: Keep effort easy. Focus on time on feet rather than pace.
fr: Gardez un effort facile. Visez le temps passé debout plutôt que l'allure.

# prebrief.pacing.moderate
source: Start conservative and assess how you feel after the first 2 km.
fr: Partez prudent et évaluez vos sensations après les 2 premiers kilomètres.

# prebrief.pacing.needsRest
source: Consider skipping this session or keeping it very light.
fr: Envisagez de sauter cette séance ou de la garder très légère.

# prebrief.pacing.noData
source: No readiness data. Start easy and adjust by feel.
fr: Aucune donnée de fraîcheur. Partez facile et ajustez aux sensations.

# prebrief.pacing.ready
source: Good to push today. Run by feel within the planned intensity.
fr: Bon pour pousser aujourd'hui. Courez aux sensations dans l'intensité prévue.

# prebrief.summary
source: Last 7 days: %1$@ km, %2$lld m D+ across %3$lld runs.
fr: 7 derniers jours : %1$@ km, %2$lld m D+ sur %3$lld sorties.

source: Predicted
fr: Prédit

source: Predicted finish
fr: Arrivée prévue

source: Predicted Finish Time
fr: Temps d'arrivée estimé

source: Prediction Accuracy
fr: Précision de la prédiction

source: Prefer Real Food
fr: Préférer les aliments naturels

source: Preferences
fr: Préférences

source: Preferred Unit
fr: Unité préférée

source: Preferred Units
fr: Unités préférées

# premium.lock.finishEstimate.message
source: Unlock your predicted race time, splits and confidence range.
fr: Débloquez votre temps de course estimé, vos splits et la marge de confiance.

# premium.lock.finishEstimate.title
source: Finish-time prediction
fr: Prédiction du temps d'arrivée

# premium.lock.fitness.message
source: Unlock your live fitness estimate across every distance.
fr: Débloquez votre estimation de forme en direct sur toutes les distances.

# premium.lock.fitness.title
source: Current fitness
fr: Forme actuelle

# premium.lock.volumeChart.message
source: See how your volume builds across the whole block.
fr: Voyez comment votre volume progresse sur tout le bloc.

# premium.lock.volumeChart.title
source: Training trends
fr: Tendances d'entraînement

# premium.unlock.cta
source: Unlock with Premium
fr: Débloquer avec Premium

source: Preparing nutrition plan
fr: Préparation du plan nutritionnel

source: Previous month
fr: Mois précédent

source: Previous phase
fr: Phase précédente

source: Priority
fr: Priorité

source: Privacy
fr: Confidentialité

source: Privacy Policy
fr: Politique de confidentialité

# prmt.1h.desc
source: Tight window, lighter meal, mostly liquid calories
fr: Fenêtre serrée, repas plus léger, surtout des calories liquides

# prmt.1h.title
source: 1 hour before
fr: 1 heure avant

# prmt.2h.desc
source: Most common, moderate meal, familiar foods
fr: Le plus courant, repas modéré, aliments familiers

# prmt.2h.title
source: 2 hours before
fr: 2 heures avant

# prmt.3h.desc
source: Traditional, full carb meal, lowest GI risk
fr: Traditionnel, repas riche en glucides, risque digestif le plus faible

# prmt.3h.title
source: 3 hours before
fr: 3 heures avant

# prmt.4h.desc
source: Long window, full meal, early wake-up
fr: Fenêtre longue, repas complet, réveil matinal

# prmt.4h.title
source: 4 hours before
fr: 4 heures avant

# prod.bar
source: Bar
fr: Barre

# prod.chew
source: Chew
fr: Gomme

# prod.drink
source: Drink
fr: Boisson

# prod.realFood
source: Real Food
fr: Vraie nourriture

# prod.salt
source: Salt
fr: Sel

# prodname.applesauce
source: Applesauce Pouch
fr: Compote de pommes (gourde)

# prodname.banana
source: Banana
fr: Banane

# prodname.boiledPotato
source: Boiled Potato (salted)
fr: Pomme de terre bouillie (salée)

# prodname.boneBroth
source: Bone Broth Cup
fr: Tasse de bouillon d'os

# prodname.medjoolDate
source: Medjool Date
fr: Datte Medjool

# prodname.pbj
source: PB & J Quarter
fr: Quart de sandwich cacahuète-confiture

# prodname.pretzels
source: Pretzels (handful)
fr: Bretzels (une poignée)

# prodname.riceBall
source: Rice Ball (Onigiri)
fr: Boule de riz (onigiri)

# prodname.saltCapsule
source: Salt Capsule
fr: Gélule de sel

source: Product Info
fr: Info produit

source: Product library
fr: Bibliothèque de produits

source: Product Library
fr: Bibliothèque de produits

source: Products, timing & gut training schedule
fr: Produits, timing et planning d'entraînement digestif

source: Profile
fr: Profil

source: Profile ID or display name
fr: ID de profil ou nom d'affichage

source: Profile Summary
fr: Résumé du profil

# profile.age
source: %lld yrs
fr: %lld ans

# profile.deleteRace.confirm
source: Delete Race
fr: Supprimer la course

# profile.deleteRace.message
source: %@ will be removed from your calendar and your training plan will adapt around it. This can't be undone.
fr: %@ sera retirée de votre calendrier et votre plan d'entraînement s'adaptera en conséquence. Cette action est irréversible.

# profile.deleteRace.title
source: Delete this race?
fr: Supprimer cette course ?

# profile.personalRecords
source: Personal records
fr: Records personnels

source: Progress: %@
fr: Progression : %@

source: Progressive training. Recommended for most runners.
fr: Entraînement progressif. Recommandé pour la plupart des coureurs.

source: Projected curve
fr: Courbe projetée

source: Projected Finish
fr: Arrivée projetée

source: Projected finish time, %@
fr: Temps d'arrivée projeté, %@

source: Projected Form
fr: Forme projetée

source: Protein
fr: Protéines

# ptrend.aerobic
source: Aerobic Efficiency
fr: Efficacité aérobie

# ptrend.climbing
source: Climbing Efficiency
fr: Efficacité en montée

# ptrend.fade
source: Endurance Fade
fr: Baisse d'endurance

# ptrend.recovery
source: Recovery Rate
fr: Vitesse de récupération

source: Public Profile
fr: Profil public

source: Purchase Date
fr: Date d'achat

source: Purchased
fr: Acheté

source: Purpose: %@
fr: Objectif : %@

source: Quality Session Focus
fr: Focus des séances de qualité

source: Quick Add
fr: Ajout rapide

source: Quick summary
fr: Résumé rapide

source: Quiet Hours
fr: Heures calmes

source: Race
fr: Course

source: Race Calendar
fr: Calendrier de courses

source: Race calendar grid
fr: Grille du calendrier de courses

source: Race calendar list
fr: Liste du calendrier de courses

source: Race Countdown
fr: Compte à rebours course

source: Race date
fr: Date de la course

source: Race Date
fr: Date de course

source: Race Day
fr: Jour J

source: RACE DAY
fr: JOUR DE COURSE

source: Race Day Plan
fr: Plan du jour de course

source: Race Day Schedule
fr: Planning jour de course

source: Race Day Weather
fr: Météo jour de course

source: Race Day: %@
fr: Jour de course : %@

source: Race Estimate
fr: Estimation course

source: Race Forecast
fr: Prévision de course

source: Race Goal
fr: Objectif de course

source: Race Info
fr: Info course

source: Race is too close to the start of your plan to project an evolution curve.
fr: La course est trop proche du début de votre plan pour projeter une courbe d'évolution.

source: Race Location
fr: Lieu de la course

source: Race Name
fr: Nom de la course

source: Race Name (e.g. UTMB, Diagonale des Fous)
fr: Nom de la course (ex. UTMB, Diagonale des Fous)

source: Race Overview
fr: Aperçu de la course

source: Race Performance
fr: Performance de course

source: Race Prep
fr: Préparation course

source: Race Prep Checklist
fr: Checklist de préparation

source: Race Profile
fr: Profil de la course

source: Race Readiness
fr: Préparation à la course

source: Race Report
fr: Rapport de course

source: RACE TIMELINE
fr: CHRONOLOGIE DE COURSE

source: Race Type
fr: Type de course

source: RACE WEEK FUELLING
fr: NUTRITION DE LA SEMAINE DE COURSE

source: Race-day fueling strategy
fr: Stratégie d'alimentation de course

source: Race-day nutrition strategy
fr: Stratégie nutritionnelle le jour J

source: Race-pace prep for this race
fr: Préparation à l'allure de course pour cette course

# race.checkpoints
source: Checkpoints
fr: Points de passage

# race.checkpoints.footer
source: Import a GPX file or add waypoints manually for predicted split times.
fr: Importez un fichier GPX ou ajoutez des points manuellement pour estimer les temps de passage.

# race.dminus
source: D- (loss)
fr: D- (négatif)

# race.dplus
source: D+ (gain)
fr: D+ (positif)

# race.elevation
source: Elevation
fr: Dénivelé

# race.goal
source: Goal
fr: Objectif

# race.importGPX
source: Import GPX course
fr: Importer un parcours GPX

source: Race info
fr: Infos course

# race.location
source: Location
fr: Lieu

# race.location.footer
source: Used for weather forecasts in your race day estimate.
fr: Utilisé pour les prévisions météo de votre estimation le jour de la course.

# race.pickRoute
source: Pick from route library
fr: Choisir dans la bibliothèque d'itinéraires

# race.priority
source: Priority
fr: Priorité

# race.setLocation
source: Set race location
fr: Définir le lieu de la course

# race.terrain
source: Terrain difficulty
fr: Difficulté du terrain

# raceGoal.finish
source: Finish
fr: Terminer

# raceGoal.targetRanking
source: Target Ranking
fr: Classement cible

# raceGoal.targetTime
source: Target Time
fr: Temps cible

source: Races
fr: Courses

source: Races during prep?
fr: Des courses pendant la prépa ?

source: Range
fr: Plage

source: Rank %lld
fr: Rang %lld

# Rank %lld, %@, %@ %@, %lld percent
source: Rank %1$lld, %2$@, %3$@ %4$@, %5$lld percent
fr: Rang %1$lld, %2$@, %3$@ %4$@, %5$lld pour cent

source: Rate of Perceived Exertion
fr: Taux d'effort perçu

source: Rate on App Store
fr: Noter sur l'App Store

source: Rate Your Effort
fr: Évaluez votre effort

source: Re-center
fr: Recentrer

source: Re-center map
fr: Recentrer la carte

source: Read more
fr: Lire la suite

source: Readiness: %@
fr: Forme : %@

# Readiness: %@, score %lld
source: Readiness: %1$@, score %2$lld
fr: Forme : %1$@, score %2$lld

source: Reading workouts...
fr: Lecture des séances...

source: Ready to Run?
fr: Prêt à courir ?

source: Real food
fr: Vraie nourriture

source: Reason
fr: Raison

source: Rebalance the plan
fr: Rééquilibrer le plan

source: Rebuilding
fr: Reconstruction

source: Rec.
fr: Recom.

source: Recalculating fitness & fatigue
fr: Recalcul de la forme et de la fatigue

source: Recalibrates your pace targets
fr: Recalibre vos allures cibles

source: Recent Runs (%lld)
fr: Courses récentes (%lld)

source: Recommendations
fr: Recommandations

source: Record a run in the app, then come back to link it.
fr: Enregistrez une course dans l'app, puis revenez pour la lier.

source: Recording stats & performance data
fr: Enregistrement des stats et données de performance

source: Recovery
fr: Récupération

source: Recovery data will appear after sleep tracking is available.
fr: Les données de récupération apparaîtront quand le suivi du sommeil sera disponible.

source: Recovery History
fr: Historique de récupération

source: Recovery history will appear after a few days of tracking.
fr: L'historique de récupération apparaîtra après quelques jours de suivi.

source: Recovery meals
fr: Repas de récupération

source: Recovery Reminders
fr: Rappels de récupération

# Recovery score %lld out of 100, %@
source: Recovery score %1$lld out of 100, %2$@
fr: Score de récupération %1$lld sur 100, %2$@

source: Recovery Trend
fr: Tendance de récupération

source: Refer a Friend
fr: Parrainer un ami

source: Reflection
fr: Réflexion

source: Refresh forecast
fr: Actualiser les prévisions

source: Refresh Health Data
fr: Actualiser les données santé

source: Regenerate
fr: Régénérer

source: Relationship
fr: Relation

source: Remaining
fr: Restant

source: Remove
fr: Retirer

source: Removes the connection to your Strava account
fr: Supprime la connexion à votre compte Strava

source: Removes your like
fr: Retire votre j'aime

source: Rep %lld
fr: Rép %lld

source: Repeat: %lldx
fr: Répétition : %lldx

source: Repeats
fr: Répétitions

source: Replay progress
fr: Rejouer la progression

source: Replay run
fr: Rejouer la course

source: Request Permission
fr: Demander l'autorisation

source: Requests App Tracking Transparency permission
fr: Demande l'autorisation de suivi publicitaire

source: Requests permission to read and write health data
fr: Demande l'autorisation de lire et écrire les données santé

source: Require %@ to open UltraTrain.
fr: Exiger %@ pour ouvrir UltraTrain.

source: Requires %@ authentication to open the app
fr: Nécessite l'authentification %@ pour ouvrir l'app

source: Reschedule
fr: Reprogrammer

source: Resend code in %llds
fr: Renvoyer le code dans %llds
